---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCProductWrapper.GetAnElement
source: html/66f19c6e-c1d6-be9e-808b-36e3d8d9e1b6.htm
---
# Autodesk.Revit.DB.IFC.IFCProductWrapper.GetAnElement Method

Gets the first element handle added to this wrapper.

## Syntax (C#)
```csharp
public IFCAnyHandle GetAnElement()
```

## Returns
The handle.